openfoam2206/tutorials/incompressible/adjointOptimisationFoam/shapeOptimisation/motorBike/0.orig/nuaTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            adjointInletNuaTilda;
        value           uniform 0;
    }

    outlet
    {
        type            adjointOutletNuaTilda;
        value           uniform 0;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    motorBikeGroup
    {
        type            fixedValue;
        value           uniform 0;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
